### Importing necessary libraries

In [1]:
import numpy as np
import pandas as pd

In [2]:
import tensorflow as tf

In [3]:
data=pd.Series([1,2,3,4,5,6],index=['d','b','c','q','r','y'])
data

d    1
b    2
c    3
q    4
r    5
y    6
dtype: int64

In [5]:
data1=data.reindex(index=['q','b','c','d','r','y'])
data1

q    4
b    2
c    3
d    1
r    5
y    6
dtype: int64

In [8]:
data.reindex(index=np.arange(6))

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
dtype: float64

In [15]:
data4=pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','d','c'],columns=['Andhra','TamilNadu','Kerala'])
data4

   Andhra  TamilNadu  Kerala
a       0          1       2
d       3          4       5
c       6          7       8

In [16]:
data5=data4.reindex(index=['a','b','c','d'])
data5

   Andhra  TamilNadu  Kerala
a     0.0        1.0     2.0
b     NaN        NaN     NaN
c     6.0        7.0     8.0
d     3.0        4.0     5.0

In [17]:
capitals=['MP','Andhra','TamilNadu','Kerala']
data5=data5.reindex(columns=capitals)
data5

   MP  Andhra  TamilNadu  Kerala
a NaN     0.0        1.0     2.0
b NaN     NaN        NaN     NaN
c NaN     6.0        7.0     8.0
d NaN     3.0        4.0     5.0

In [20]:
data5.loc[['a','b','c','d']]

   MP  Andhra  TamilNadu  Kerala
a NaN     0.0        1.0     2.0
b NaN     NaN        NaN     NaN
c NaN     6.0        7.0     8.0
d NaN     3.0        4.0     5.0

### Dropping values in pandas

In [32]:
d1=pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','d','c'],columns=['Andhra','TamilNadu','Kerala'])
d1

   Andhra  TamilNadu  Kerala
a       0          1       2
d       3          4       5
c       6          7       8

In [33]:
d1.drop('a')

   Andhra  TamilNadu  Kerala
d       3          4       5
c       6          7       8

In [34]:
d1

   Andhra  TamilNadu  Kerala
a       0          1       2
d       3          4       5
c       6          7       8

In [35]:
d2=d1.drop(['a','d'])
d2

   Andhra  TamilNadu  Kerala
c       6          7       8

In [36]:
d3=d1.drop('Kerala',axis=1)
d3

   Andhra  TamilNadu
a       0          1
d       3          4
c       6          7

In [37]:
d3=d1.drop('Kerala',axis='columns')
d3

   Andhra  TamilNadu
a       0          1
d       3          4
c       6          7

#### Adding values in series

In [38]:
ser1=pd.Series([1,2,3,4,5],index=['a','c','d','e','g'])
ser2=pd.Series([2,6,8,0,5],index=['a','v','e','d','g'])

ser1+ser2

a     3.0
c     NaN
d     3.0
e    12.0
g    10.0
v     NaN
dtype: float64

In [40]:
df3=pd.DataFrame({'A':[1,2]})
df3

   A
0  1
1  2

### Treating null values

In [50]:
df5=pd.DataFrame(np.arange(20).reshape((4,5)),columns=list('abcde'))
df5

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [51]:
df5.loc[1,'d']=np.nan
df6=df5
df6

    a   b   c     d   e
0   0   1   2   3.0   4
1   5   6   7   NaN   9
2  10  11  12  13.0  14
3  15  16  17  18.0  19

In [52]:
df5+df6

    a   b   c     d   e
0   0   2   4   6.0   8
1  10  12  14   NaN  18
2  20  22  24  26.0  28
3  30  32  34  36.0  38

### lambda functions in dataframe

In [55]:
df4=pd.DataFrame(np.random.randn(12).reshape((3,4)),index=['one','two','three'],columns=['Hoo','muu','qqw','iiit'])
df4

            Hoo       muu       qqw      iiit
one    0.188724  1.924790  0.672624 -0.010763
two   -0.207270 -0.499958 -0.954370 -0.340513
three -1.004842  0.401979 -1.151506  0.014892

In [56]:
abs(df4)

            Hoo       muu       qqw      iiit
one    0.188724  1.924790  0.672624  0.010763
two    0.207270  0.499958  0.954370  0.340513
three  1.004842  0.401979  1.151506  0.014892

In [59]:
f=lambda x: x.max()
df4.apply(f,axis=0)

Hoo     0.188724
muu     1.924790
qqw     0.672624
iiit    0.014892
dtype: float64

In [60]:
def f(x):
    return pd.Series([x.max(),x.mean(),x.min()],index=['max','mean','min'])

In [61]:
df4.apply(f)

           Hoo       muu       qqw      iiit
max   0.188724  1.924790  0.672624  0.014892
mean -0.341129  0.608937 -0.477750 -0.112128
min  -1.004842 -0.499958 -1.151506 -0.340513

In [63]:
f=lambda x: '%.3f' %x
df4.applymap(f)

          Hoo     muu     qqw    iiit
one     0.189   1.925   0.673  -0.011
two    -0.207  -0.500  -0.954  -0.341
three  -1.005   0.402  -1.152   0.015

### Sorting and Ranking

In [64]:
series=pd.Series(np.arange(6),index=['a','n','d','w','r','y'])
series

a    0
n    1
d    2
w    3
r    4
y    5
dtype: int32

In [65]:
series.sort_index(axis=0,level=None,ascending=True)

a    0
d    2
n    1
r    4
w    3
y    5
dtype: int32